[!Global]
!LanguageID=1049
!LanguageName=Russian (by Netman25_new)
!TranslationAuthor=Netman25
!TranslationAuthorEmail=netman25@mail.ru
!TranslationDefaultFont=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET

[TFrmMain]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Программатор CH341A
mFile.Caption=&Файл
mOpen.Caption=&Открыть
mSave.Caption=&Сохранить
mExit.Caption=В&ыход
mBuffer.Caption=Буфер &данных
mFill.Caption=&Заполнить буфер данных
mSwap.Caption=Обмен &байтов
mCopy.Caption=&Копировать
mCopyAsHex.Caption=Копировать как &hex
mFind.Caption=&Найти
mFindNext.Caption=Найти да&лее
mGoto.Caption=&Перейти
mSelectAll.Caption=Выделить &все
mReset.Caption=С&бросить
mOpter.Caption=&Действия
mOpterOption.Caption=Настройки &операций
mAuto.Caption=&Авто-прошивка
mChkEmpty.Caption=&Проверка на чистоту
mRead.Caption=Про&читать чип
mWrite.Caption=&Записать чип
mVerify.Caption=&Проверить чип
mClean.Caption=&Очистить чип
mAbort.Caption=От&мена
mDetect.Caption=&Определить
mlanguages.Caption=&Языки
mHelp.Caption=&Помощь
mHelpContent.Caption=&Помощь
mLicense.Caption=&О лицензии
mAbout.Caption=О &программе
pCopy.Caption=&Копировать
pCopyAsHex.Caption=Копировать как &hex
pSelectAll.Caption=Выделить &все
BtnOpen.Caption=Открыть
BtnOpen.Hint=Открыть
BtnSave.Caption=Сохранить
BtnSave.Hint=Сохранить
BtnFill.Caption=Заполнить
BtnFill.Hint=Заполнить буфер данных
BtnSwap.Caption=Обмен
BtnSwap.Hint=Обмен байтов
BtnAuto.Caption=Авто
BtnAuto.Hint=Автопрошивка
BtnChkEmpty.Caption=Проверить на чистоту
BtnChkEmpty.Hint=Проверить на чистоту
BtnRead.Caption=Чтение
BtnRead.Hint=Прочитать чип
BtnWrite.Caption=Запись
BtnWrite.Hint=Записать чип
BtnVerify.Caption=Верификация
BtnVerify.Hint=Проверить правильность записи
BtnClean.Caption=Очистить
BtnClean.Hint=Очистить чип
BtnAbort.Caption=Отмена
BtnAbort.Hint=Отмена
BtnAbout.Caption=О программе
BtnAbout.Hint=О программе
BtnExit.Caption=Выход
BtnExit.Hint=Выход
pmChkEmpty.Caption=&Проверить на чистоту
pmWrite.Caption=&Записать
pmVerify.Caption=&Проверить
pmClean.Caption=&Очистить
lbChipType.Caption=Тип:
lbManuName.Caption=Произ:
lbChipName.Caption=Имя:
lbChipSize.Caption=Разм.:
BtnChipFind.Caption=Поиск &чипов
BtnDetect.Caption=&Определить
spStatus.!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
RzToolbar.CustomizeCaptions.Close=&Закрыть
RzToolbar.CustomizeCaptions.MoveDown=Переместить вниз
RzToolbar.CustomizeCaptions.MoveUp=Переместить вверх
RzToolbar.CustomizeCaptions.NoTextLabels=Только значки
RzToolbar.CustomizeCaptions.SelectiveTextOnRight=Выборочно текст справа
RzToolbar.CustomizeCaptions.ShowTextLabels=Отображать текст
RzToolbar.CustomizeCaptions.TextOptions=Опции текста
RzToolbar.CustomizeCaptions.Title=Настройка панели инструментов
OD.DefaultExt=Bin
OD.Filter=Поддерживаемые файлы (*.bin;*.rom;*.hex)|*.bin;*.rom;*.hex|BIN File (*.bin)|*.bin|ROM File (*.rom)|*.rom|HEX File (*.hex)|*.hex|Все файлы (*.*)|*.*
SD.DefaultExt=Bin
SD.Filter=Поддерживаемые файлы (*.bin;*.rom;*.hex)|*.bin;*.rom;*.hex|BIN File (*.bin)|*.bin|ROM File (*.rom)|*.rom|HEX File (*.hex)|*.hex|Все файлы (*.*)|*.*
sCH341_Status=Состояние: %s.
sUseTime=%s - Время: %s
sRW_UseTime=%s - Скорость: %d Байт/Сек, Размер: %d Байт, Время: %s
sEditorOffset=Смещение: %s, %d
sNoCH341=Программатор не подключен к ПК!
sIgnoreLengthRange=Длина файла вне диапазона игнорируется.
sRangeAddress=Диапазон(0x%s-0x%s)
sNoChipEmpty=Чип %s не пустой.
sWriteOperTimeout=Операции записи прерваны по таймауту! код: %d
sEraseOperTimeout=Операции стирания прерваны по таймауту! код: %d
sChipContentDifferent=Чип %s и содержимое не соответствуют.
sEraseOk=Очистка чипа завершена, проверьте что он пуст!
sChipBlank=Чип %s пуст!
sChipVerifyOK=Чип %s и буфер одинаковы!
sAllOperCompleted=Все операции завершены. 
sBeginRange=Начальный адрес диапазона
sEndRange=Конечный адрес диапазона
sNotExit=Программатор в работе, выход запрещен.
sFindNotWords=Не найдено "%s"
sFindNotChip=Ошибка детекции, чип не найден.
sGoto=Перейти
sUserAbort=Отменено пользователем
sCheckDriver=Драйвер определен некорректно, установите драйвер.
sTrialNotSupport=Эта функция недоступна в пробной версии.
sNoShowTip=Не показывать этот совет
sConnectionStatus0=Отключено
sConnectionStatus1=Подключено
sInsertMode0=Перезапись
sInsertMode1=Вставка
sWorkStatus0=Проверка...
sWorkStatus1=Чтение...
sWorkStatus2=Запись...
sWorkStatus3=Верификация...
sWorkStatus4=Очистка...
sWorkStatus5=Заполнение...

[ShellDialog]
SOpenCaption=Открыть
SSaveCaption=Сохранить как
SOpenButton=&Открыть
SSaveButton=&Сохранить
SCancelButton=&Отмена
SLookin=Поиск &в:
SFileName=Имя &файла:
SFilesOfType=Типы ф&айлов:
SUpOneLevelHint=На уровень вверх
SShowDesktopHint=Показать рабочий стол
SCreateNewFolderHint=Создать папку
SShowTreeHint=Вид дерева
SViewListHint=Список
SViewDetailsHint=Таблица
SViewMenu=&Вид
SViewLargeIconsMenu=К&рупные значки
SViewSmallIconsMenu=М&елкие значки
SViewListMenu=&Список
SViewDetailsMenu=&Таблица
SEditPasteMenu=&Вставить
SNewMenu=Со&здать
SNewFolderMenu=&Папку
SPropertiesMenu=С&войства

[TFrmFill]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Заполнить буфер данных
Btns.CaptionCancel=&Отмена
Btns.CaptionOk=&OK
GB1.!CaptionFont=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
GB2.!CaptionFont=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
GB1.Caption=Данные
GB2.Caption=Диапазон(0x0-0x0)
rbbit1.Caption=Постоян. байт (8bit)
rbbit2.Caption=Постоян. байт (16bit)
rbbit3.Caption=Случайно
rbbit4.Caption=Послед. байты (8bit)
rbbit5.Caption=Послед. слова (16bit)
RzLabel1.Caption=HEX:
RzLabel2.Caption=HEX:
RzLabel3.Caption=От:
RzLabel4.Caption=До:

[TFrmFind]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Поиск
lbFind.Caption=&Что найти:
cbNoCase.Caption=&Учитывать регистр
cbHex.Caption=&Hex формат
BtnFind.Caption=На&йти далее
BtnClose.Caption=&Отмена

[TFrmOperOption]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Настройки
GB1.Caption=Общие
ChkAllowWindow.Caption=&Разрешить запуск нескольких копий
ChkWriteCompleteVerify.Caption=&Завершать запись после верификации
ChkWriteWaitTime.Caption=Зап&ись после
ChkLastDir.Caption=&Запоминать последнюю папку
ChkWinStatus.Caption=З&апоминать размер и положение окна
lbSec.Caption=Секунд
ChkSysDialog.Caption=Использовать диалоги &Windows
ChkAllowSkipFF.Caption=Пропускать &пустые данные
GB2.Caption=Чипы 25/26 серии
ChkUseFastRead.Caption=&Режим быстрого чтения
ChkUseAAI.Caption=Чипы SST/ESMT прошивать в режиме &AAI
ChkEraseMode.Caption=Режим стирания &блок/сектор
GB3.Caption=Автопрошивка
CL.!GroupFont=MS Sans Serif,8,B,,clHighlight,DEFAULT_CHARSET
CL.Items.Text=Очистка<BR>Проверка на чистоту<BR>Прошивка<BR>Верификация<BR>
PRG.!CaptionFont=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
PRG.!ItemFont=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
PRG.Caption=Диапазон прошивки
PRG.Items.Text=Основная память<BR>Защищенная память (OTP)<BR>Полностью (Основная + OTP)<BR>
Btns.CaptionOk=&OK
Btns.CaptionCancel=&Отмена

[TFrmChipSel]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Поиск чипов
lbChipName.Caption=Имя чипа:
lbChipFindInfo.Caption=Без учета регистра, с поддержкой маски '*', например: EN25*80
DBGrid.Columns.Item0.Title.Caption=Имя чипа
DBGrid.Columns.Item1.Title.Caption=Объем
DBGrid.Columns.Item2.Title.Caption=Производитель
DBGrid.Columns.Item3.Title.Caption=Тип
Btns.CaptionCancel=&Отмена
Btns.CaptionOk=&Выбор
sChipFindCount=Найдено %d чипов.

[TFrmSelChip]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Caption=Выберите
sChipSimilarCount=Найдено %d похожих моделей, выберите ваш чип.
Btns.CaptionCancel=&Отмена
Btns.CaptionOk=&Выбор

[TFrmLicense]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
Btns.CaptionOk=&OK
Caption=О лицензии
lbAddr.Caption=Адрес:
lbEmail.Caption=Email:
lbID.Caption=ID:
lbName.Caption=Имя:
lbNickName.Caption=Ник:
lbPhone.Caption=Тел.:


[TFrmAbout]
!Font=MS Sans Serif,8,,0,clWindowText,DEFAULT_CHARSET
sAboutCaption=О программе
sVerCaption=Версия: 
sAuthorCaption=Автор: 
sClose=&Закрыть
sLicenseCaption=Лицензия: 
sAuthor=Campanula night Siyu(SkyGz)
sCopyRight=Copyright (C) 2004 Maple Online